Revit 2027 API
CurveByPoints.ReferenceType Property
Indicates the type of reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferenceType ReferenceType { get; set; }
Public Property ReferenceType As ReferenceType
	Get
	Set
public:
property ReferenceType ReferenceType {
	ReferenceType get ();
	void set (ReferenceType value);
}
member ReferenceType : ReferenceType with get, set
Property Value
ReferenceType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when argument is out of range.
InvalidOperationException |  Thrown when regeneration failed.
See Also
Reference
CurveByPoints Class
Autodesk.Revit.DB Namespace